CREATE EXTENSION IF NOT EXISTS pgcrypto;

INSERT INTO departments
VALUES (default, 'Департамент №1', 'Москва, ул. Садовая, 1', false),
       (default, 'Департамент №2', 'Москва, Красногвардейский проезд, 21', false),
       (default, 'Департамент #3', 'Москва, Кремлёвская улица, 18Б', true);

INSERT INTO drivers
VALUES (default, 'Никитников Ринат', 41, '+7 (915) 264-85-93', false),
       (default, 'Хусид Глеб', 36, '+7 (925) 731-49-06', false),
       (default, 'Зарубин Тимофей', 53, '+7 (916) 408-27-15', false),
       (default, 'Гилев Юрий', 29, '+7 (903) 156-84-72', false),
       (default, 'Волков Артем', 28, '+7 (977) 342-91-58', false),
       (default, 'Белов Анатолий', 34, '+7 (999) 675-23-40', false),
       (default, 'Сухарев Игорь', 37, '+7 (495) 782-61-34', false),
       (default, 'Николаевский Павел', 29, '+7 (985) 219-47-63', false);

INSERT INTO stations
VALUES (default, 'Серебряный бор', 'Строгино', false),
       (default, 'Проспект Буденного', 'Соколиная гора', false),
       (default, '2-я Черногрязская улица', 'Пресненский', false),
       (default, 'Скарятинский переулок', 'Патриаршие пруды', false),
       (default, 'Метро Бульвар Рокоссовского', 'Богородское', false),
       (default, 'Рижский вокзал', 'Марьина роща', false),
       (default, 'Мосгорсуд', 'Преображенское', false),
       (default, 'Метро Сокольники', 'Сокольники', false),
       (default, '138-й квартал Выхина', 'Выхино-Жулебино', false),
       (default, 'Серпуховский Вал', 'Донской', false),
       (default, 'Префектура ЮАО', 'Южнопортовый', false),
       (default, 'Метро Кузьминки', 'Кузьминки', false),
       (default, 'Прибрежный проезд', 'Левобережный', false),
       (default, 'Карамышевская набережная', 'Хорошево-Мневники', false),
       (default, 'Улица Мнёвники, 4', 'Хорошево-Мневники', false),
       (default, 'Гидропроект', 'Сокол', false);

INSERT INTO paths
VALUES ('м3', 1, 2, 5400000, false),
       ('265', 5, 6, 2400000, false),
       ('с799', 9, 10, 3600000, false),
       ('403', 13, 14, 4860000, true);

INSERT INTO buses
VALUES ('54837291045628374651', 'м3', 2, 36, 'бензин', true, false),
       ('69012384572301985624', '265', 1, 28, 'электрический', true, false),
       ('31247586903214567890', 'с799', 1, 30, 'бензин', true, false),
       ('98765432100123456789', '403', 2, 31, 'электрический', true, true);

INSERT INTO buses_drivers
VALUES ('54837291045628374651', 1),
       ('54837291045628374651', 2),
       ('69012384572301985624', 3),
       ('69012384572301985624', 4),
       ('31247586903214567890', 5),
       ('31247586903214567890', 6),
       ('98765432100123456789', 7),
       ('98765432100123456789', 8);

INSERT INTO paths_stations
VALUES ('м3', 1, 0),
       ('м3', 2, 5400000),
       ('м3', 3, 10000),
       ('м3', 4, 840000),
       ('265', 5, 0),
       ('265', 6, 2400000),
       ('265', 7, 53200),
       ('265', 8, 120500),
       ('с799', 9, 0),
       ('с799', 10, 3600000),
       ('с799', 11, 910000),
       ('с799', 12, 30000),
       ('403', 13, 0),
       ('403', 14, 4860000),
       ('403', 15, 927800),
       ('403', 16, 17400);

INSERT INTO bus_users
VALUES ('admin_1', crypt('admin_password_1', gen_salt('bf')), ARRAY['USER', 'ADMIN']),
       ('admin_2', crypt('admin_password_2', gen_salt('bf')), ARRAY['USER', 'ADMIN']),
       ('user_1', crypt('user_password_1', gen_salt('bf')), ARRAY['USER']),
       ('user_2', crypt('user_password_2', gen_salt('bf')), ARRAY['USER']);